/*********************************************************************************
**********************************************************************************
* 文件名称: adc.h                                                         	 	     *
* 文件简述：定时器6触发ADC1通道0/1采样，DMA搬运									                   *
* 创建日期：2024.05.06                                                          	 *
* 说    明：采样率可调																			   						 				 *
**********************************************************************************
*********************************************************************************/

#ifndef __ADC_H
#define __ADC_H	
#include "common.h"
#include "dma.h"
#include "timer.h"
#include "fft.h"

//////////////////////////////////////////////////////////////////////////////////	 

#define Fs 256	//采样率kHz
//#define ChannelSize 2	//通道数
#define ChannelSize 1
#define Sampl_Times 4096	//FFT_N
extern u16 ADC1_Data_Rx[1*Sampl_Times];	//采样数据存储，通道0与通道1数据交替
extern u16 ADC3_Data_Rx[ChannelSize*Sampl_Times];	
void ADC1_Init(void);	//ADC1通道初始化
void ADC3_Init(void);
#endif
