/*********************************************************************************
**********************************************************************************
* 文件名称: dac.h                                                         	    	 *
* 文件简述：DAC1定时器6触发，输出可更改，DMA搬运								          	       *
* 创建日期：2024.05.06                                                          	 *
* 说    明：DAC_Data_Tx为输出固定值，DAC1_Data_Tx为连续输出波形										 *
**********************************************************************************
*********************************************************************************/

#ifndef __DAC_H
#define __DAC_H
#include "common.h"
#include "dma.h"
#include "timer.h"

//////////////////////////////////////////////////////////////////////////////////

#define DataSize 4096	//输出固定值时取消注释，并将下面的DataSize注释
extern u16 DAC_Data_Tx;	//DAC输出固定值，可随时在主函数while(1)中更改

//#define DataSize 256	//数据长度
//extern u16 DAC1_Data_Tx[DataSize];	//DAC连续输出正弦波表

void DAC1_Init(void);	//DAC初始化

#endif
